package com.oopsw.basic;

public class User {

	public static void main(String[] args) {
		System.out.println("Start Java");
		 // 문법이야 패턴이야 그냥 다해 좋은 습관이 몸에 베요. 그러면 회사가서도 최소한 너 어디서 이렇게 배웠어? 라는 소리는 안들을 거야. 가끔 신입으로 들어갈떄 너 어디서 이렇게 잘 배웠어? 라고 칭찬할때만 메일 보내! 나도 가끔은 칭찬이 곱하단 말이야. 이 타이밍에 이게 궁금해야되는데~ 이해했다고 대답하는거 보다는 이해가 안됐다고 하는게 더 중요한데 어릴때 부모님에게 질문하면 어린것이 감히! 라는 소리 들으 본적이 있는 사람 손 들어 봐. 야 다음 시간에 할거야. 그러면 질문 못해요. 자 그래서 환경이 정말 중요하죠. 한국사람이나 아시아 사람들이 질문을 왜 잘 못하냐면 스토리가 있어요. 2차 세계대전이후로 전쟁을 겪은 나라가 있어요. 대표적으로 한국과 베트남이 있어요. 그래서 싹 쓸어버렸어. 그러면 어떻게 해야돼요? 처음부터 다시 쌓아야죠? 사람들은 빨리빨리의 문화죠? 그 이유를 저번에 말했는데... 우리는 빨리빨리의 문화가 사계절 때문이라고 해요. 일상생활에서 미루면 일이 안돼요. 여러분 말고 우리 부모세대들은 자신은 공부를 못했으니 공부를 해야돼. 그런데 재밌는건 imf를 겪은 세대는 공부 해봤자 소용없더라. 그 다음은 기술을 배워라. 의사들이 그렇죠. 그래서 우리 문화는 빨리빨리? 내가 잘하는걸 해라. 그래서 우리나라는 산이 많아요. 시야가 좁아요. 그래서 자바로 잘 개발한 사람들이 api로 잘 개발한걸 보면 되지 않을까? 그래서 mz라 하면서 말을 막하는데 무식해보일때 많아요. 그러면 안돼요. 크롬 브라우저 좀 까세요. 이유가 있어요. 나중에 웹 개발환경 디버깅할때 필요해요. 그래서 크롬 브라우저는 사용자 툴이기도 하지만 개발자 툴이기도해요.
		 
	}
}