package com.oopsw.academyStudentManagment.dao;

public class AcademyStudentManagerMentDAO {
	//업무 List_SQL
	/**1. 회원가입 - 새로운 관리자 정보를 등록*/
	/**2. 회원가입 - 관리자 이메일 중복 확인*/
	/**3. 관리자 로그인*/
	/**4. 반 정보 조회*/
	/**5. 수준,학년,과목 별 조회*/
	/**6. 반 별 학생 목록 조회*/
	/**7. 반 강사 이름,요일,시간 수정*/
	/**8. 학생 수강 정보 등록*/
	/**9. 기존 학생 정보 수정*/
	/**10. 기존 학생 출결 정보 삭제*/
	/**11. 기존 학생 수강 정보 삭제*/
	/**12. 기존 학생 정보 삭제*/
	/**13. 수강 번호 별 출결 일자 조회(날짜 검색 Default)*/
	/**14. 과목 별 출결 조회*/
	/**15. 출석 상태 별 출결 조회*/
	/**16. 이름 검색 출결 조회*/
	/**17. 출석율 출력*/
	/**18. 출결 상태 및 사유 등록*/
	
	/**19. 대시보드(전체 학생 수)*/
	/**20. 대시보드(운영 반 수)*/
	/**21. 대시보드(오늘의 출석률)*/
	/**22. 대시보드(오늘 학생 등록 수)*/
	/**23. 대시보드(반 별 학생 수 현황)*/
}
